export const ru = {
  // Календарь
  calendar: {
    monthFull: [
      "Январь",
      "Февраль",
      "Март",
      "Апрель",
      "Май",
      "Июнь",
      "Июль",
      "Август",
      "Сентябрь",
      "Октябрь",
      "Ноябрь",
      "Декабрь",
    ],
    monthShort: [
      "Янв",
      "Фев",
      "Мар",
      "Апр",
      "Май",
      "Июн",
      "Июл",
      "Авг",
      "Сен",
      "Окт",
      "Ноя",
      "Дек",
    ],

    dayFull: [
      "Воскресенье",
      "Понедельник",
      "Вторник",
      "Среда",
      "Четверг",
      "Пятница",
      "Суббота",
    ],

    dayShort: ["Вс", "Пн", "Вт", "Ср", "Чт", "Пт", "Сб"],
    hours: "Часы",
    minutes: "Минуты",
    done: "Готово",
    clear: "Очистить",
    today: "Сегодня",
    am: ["дп", "ДП"],
    pm: ["пп", "ПП"],

    weekStart: 1, // В России неделя начинается с понедельника
    clockFormat: 24,
  },

  // Основное
  core: {
    ok: "ОК",
    cancel: "Отмена",
    select: "Выбрать",
    "No data": "Нет данных",
  },

  // Форматы
  formats: {
    dateFormat: "%d.%m.%Y",
    timeFormat: "%H:%i",
  },

  lang: "ru-RU",

  // Диаграмма Ганта
  gantt: {
    // Заголовок / боковая панель
    "Task name": "Название задачи",
    "Start date": "Дата начала",
    Duration: "Длительность",
    Task: "Задача",
    Milestone: "Веха",
    "Summary task": "Сводная задача",

    // Боковая панель (редактирование)
    Save: "Сохранить",
    Delete: "Удалить",
    Name: "Название",
    Description: "Описание",
    "Select type": "Выберите тип",
    Type: "Тип",
    "End date": "Дата окончания",
    Progress: "Выполнение",
    Predecessors: "Предшественники",
    Successors: "Последователи",
    "Add task name": "Введите название задачи",
    "Add description": "Добавьте описание",
    "Select link type": "Выберите тип связи",
    "End-to-start": "Окончание–начало",
    "Start-to-start": "Начало–начало",
    "End-to-end": "Окончание–окончание",
    "Start-to-end": "Начало–окончание",

    // Контекстное меню / панель инструментов
    Add: "Добавить",
    "Child task": "Дочерняя задача",
    "Task above": "Задача выше",
    "Task below": "Задача ниже",
    "Convert to": "Преобразовать в",
    Edit: "Редактировать",
    Cut: "Вырезать",
    Copy: "Копировать",
    Paste: "Вставить",
    Move: "Переместить",
    Up: "Вверх",
    Down: "Вниз",
    Indent: "Сделать подзадачей",
    Outdent: "Сделать основной задачей",
    "Split task": "Разделить задачу",

    // Панель инструментов
    "New task": "Новая задача",
    "Move up": "Переместить вверх",
    "Move down": "Переместить вниз",
  },
};
